Hexagonal/UserService/Adapters/SOAPAdapter/getVMReq.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:vm="http://p.lodz.pl/vmachines">
    <soapenv:Header/>
    <soapenv:Body>
        <vm:getVMachineRequest>
            <vm:id>63c196ea-847d-406a-b93e-9db0d321d4c9</vm:id>
        </vm:getVMachineRequest>
    </soapenv:Body>
</soapenv:Envelope>
